Tekla.Structures.Drawing.EdgeChamfer
The EdgeChamfer class contains methods related to edge chamfers.
An edge chamfer is a drawing object derived from a model object.
It represents a drawing chamfer that has a reference to the
actual chamfer in the model database.

Tekla.Structures.Drawing.EdgeChamfer.Attributes
The attributes of the edge chamfer.
For more information see Tekla.Structures.Drawing.EdgeChamfer.EdgeChamferAttributes.

Tekla.Structures.Drawing.EdgeChamfer.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.EdgeChamfer.#ctor
Create instance of EdgeChamfer

Tekla.Structures.Drawing.EdgeChamfer.#ctor(System.Boolean)
Create instance of EdgeChamfer

Tekla.Structures.Drawing.EdgeChamfer.Delete
Deletes the drawing chamfer from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.EdgeChamfer.Modify
Modifies the drawing chamfer.
Returns: True on success.

Tekla.Structures.Drawing.EdgeChamfer.Insert
NOT YET IMPLEMENTED.
Returns: False.

Tekla.Structures.Drawing.EdgeChamfer.Select
Selects the drawing chamfer from the current drawing database.
Returns: True on success.